ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_rtc.h
/***************************************************************************//**
* \file cy_rtc.h
* \version 2.20
*
* This file provides constants and parameter values for the APIs for the 
* Real-Time Clock (RTC).
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
*******************************************************************************/

/**
* \addtogroup group_rtc
* \{
*
* The Real-Time Clock (RTC) driver provides an application interface 
* for keeping track of time and date.
*
* The functions and other declarations used in this driver are in cy_rtc.h. 
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions 
* and declarations in the PDL. 
*
* Use the RTC driver when the system requires the current time or date. You 
* can also use the RTC when you do not need the current time and date but you 
* do need accurate timing of events with one-second resolution.
* 
* The RTC driver provides these features:
* * Different hour format support.
* * Multiple alarm function (two-alarms).
* * Daylight Savings Time (DST) support.
* * Automatic leap year compensation.
* * Option to drive the RTC by an external 50 Hz or 60 Hz clock source
*
* The RTC driver provides access to the HW real-time clock. The HW RTC is 
* located in the Backup domain. You need to choose the clock source for the 
* Backup domain using the Cy_SysClk_ClkBakSetSource() function. If the clock 
* for the Backup domain is set and enabled, the RTC automatically 
* starts counting.
*
* The RTC driver keeps track of second, minute, hour, day of the week, day of 
* the month, month, and year.
*
* DST may be enabled and supports any start and end date. The start and end 
* dates can be a fixed date (like 24 March) or a relative date (like the 
* second Sunday in March).
*
* The RTC has two alarms that you can configure to generate an interrupt. 
* You specify the match value for the time when you want the alarm to occur.
* Your interrupt handler then handles the response. The alarm flexibility 
* supports periodic alarms (such as every minute), or a single alarm 
* (13:45 on 28 September, 2043).
*
* <b> Clock Source </b>
*
* The Backup domain can be driven by:
* * Watch-crystal oscillator (WCO). This is a high-accuracy oscillator that is
* suitable for RTC applications and requires a 32.768 kHz external crystal 
* populated on the application board. The WCO can be supplied by Backup domain 
* and therefore can run without Vddd/Vccd present. This can be used to wake the
* chip from Hibernate mode.
*
* * The Internal Low-speed Oscillator (ILO) routed from Clk_LF or directly 
* (as alternate backup domain clock source). Depending on the device power 
* mode the alternate backup domain clock source is set. For example, for 
* Deep Sleep mode the ILO is routed through Clk_LF. But for Hibernate
* power mode the ILO is set directly. Note that, the ILO should be configured to
* work in the Hibernate mode. For more info refer to the \ref group_sysclk
* driver. The ILO is a low-accuracy RC-oscillator that does not require
* any external elements on the board. Its poor accuracy (+/- 30%) means it is 
* less useful for the RTC. However, current can be supplied by an internal
* power supply (Vback) and therefore it can run without Vddd/Vccd present.
* This also can be used to wake the chip from Hibernate mode using RTC alarm 
* interrupt. For more details refer to \ref group_syspm driver description.
*
* * The Precision Internal Low-speed Oscillator (PILO), routed from Clk_LF 
* (alternate backup domain clock source). This is an RC-oscillator (ILO) that
* can achieve accuracy of +/- 2% with periodic calibration. It is not expected 
* to be accurate enough for good RTC capability. The PILO requires 
* Vddd/Vccd present. It can be used in modes down to Deep Sleep, but ceases to 
* function in Hibernate mode.
*
* * External 50 Hz or 60 Hz sine-wave clock source or 32.768 kHz square clock 
* source.
* For example, the wall AC frequency can be the clock source. Such a clock 
* source can be used if the external 32.768 kHz WCO is absent from the board.
* For more details, refer to the Cy_RTC_SelectFrequencyPrescaler() function 
* description.
*
* The WCO is the recommended clock source for the RTC, if it is present 
* in design. For setting the Backup domain clock source, refer to the 
* \ref group_sysclk driver.
*
* \note If the WCO is enabled, it should source the Backup domain directly. 
* Do not route the WCO through the Clk_LF. This is because Clk_LF is not 
* available in all low-power modes.
*
* \section group_rtc_section_configuration Configuration Considerations
*
* Before RTC set up, ensure that the Backup domain is clocked with the desired 
* clock source.
*
* To set up an RTC, provide the configuration parameters in the 
* cy_stc_rtc_config_t structure. Then call Cy_RTC_Init(). You can also set the 
* date and time at runtime. Call Cy_RTC_SetDateAndTime() using the filled 
* cy_stc_rtc_config_t structure, or call Cy_RTC_SetDateAndTimeDirect() with 
* valid time and date values. 
*
* <b> RTC Interrupt Handling </b>
*
* The RTC driver provides three interrupt handler functions: 
* Cy_RTC_Alarm1Interrupt(), Cy_RTC_Alarm2Interrupt(), and 
* Cy_RTC_CenturyInterrupt(). All three functions are blank functions with 
* the WEAK attribute. For any interrupt you use, redefine the interrupt handler
* in your source code.
*
* When an interrupt occurs, call the Cy_RTC_Interrupt() function. The RTC 
* hardware provides a single interrupt line to the NVIC for the three RTC 
* interrupts. This function checks the interrupt register to determine which 
* interrupt (out of the three) was generated. It then calls the 
* appropriate handler.
*
* \warning The Cy_RTC_Alarm2Interrupt() is not called if the DST feature is 
* enabled. If DST is enabled, the Cy_RTC_Interrupt() function redirects that 
* interrupt to manage daylight savings time using Cy_RTC_DstInterrupt().
* In general, the RTC interrupt handler function the Cy_RTC_DstInterrupt() 
* function is called instead of Cy_RTC_Alarm2Interrupt().
*
* For RTC interrupt handling, the user should:
* -# Implement strong interrupt handling function(s) for the required events 
* (see above). If DST is enabled, then Alarm2 is not available. The DST handler 
* is built into the PDL.
* -# Implement an RTC interrupt handler and call Cy_RTC_Interrupt() 
*    from there.
* -# Configure the RTC interrupt:
*     - Set the mask for RTC required interrupt using 
*       Cy_RTC_SetInterruptMask().
*     - Initialize the RTC interrupt by setting priority and the RTC interrupt 
*       vector using the Cy_SysInt_Init() function.
*     - Enable the RTC interrupt using the CMSIS core function NVIC_EnableIRQ().
*
* <b> Alarm functionality </b>
*
* To set up an alarm, enable the required RTC interrupt. Then provide the 
* configuration parameters in the cy_stc_rtc_alarm_t structure. You enable 
* any item you want matched, and provide a match value. You disable any other. 
* You do not need to set match values for disabled elements, as they are 
* ignored. 
* \note The alarm itself must be enabled in this structure. When a match 
* occurs, the alarm is triggered and your interrupt handler is called.
*
* An example is the best way to explain how this works. If you want an alarm 
* on every hour, then in the cy_stc_rtc_alarm_t structure, you provide 
* these values:
*
* Alarm_1.sec         = 0u \n
* Alarm_1.secEn       = CY_RTC_ALARM_ENABLE \n
* Alarm_1.min         = 0u \n
* Alarm_1.minEn       = CY_RTC_ALARM_ENABLE \n
* Alarm_1.hourEn      = CY_RTC_ALARM_DISABLE \n
* Alarm_1.dayOfWeekEn = CY_RTC_ALARM_DISABLE \n
* Alarm_1.dateEn      = CY_RTC_ALARM_DISABLE \n
* Alarm_1.monthEn     = CY_RTC_ALARM_DISABLE \n
* Alarm_1.almEn       = CY_RTC_ALARM_ENABLE  \n
* 
* With this setup, every time both the second and minute are zero, Alarm1 is 
* asserted. That happens once per hour. Note that, counterintuitively, to have 
* an alarm every hour, Alarm_1.hourEn is disabled. This is disabled because 
* for an hourly alarm you do not match the value of the hour.
*
* After cy_stc_rtc_alarm_t structure is filled, call the 
* Cy_RTC_SetAlarmDateAndTime(). The alarm can also be set without using the 
* cy_stc_rtc_alarm_t structure. Call Cy_RTC_SetAlarmDateAndTimeDirect() with 
* valid values.
*
* <b> The DST Feature </b>
*
* The DST feature is managed by the PDL using the RTC Alarm2 interrupt. 
* Therefore, you cannot have both DST enabled and use the Alarm2 interrupt. 
*
* To set up the DST, route the RTC interrupt to NVIC:
*
* -# Initialize the RTC interrupt by setting priority and the RTC interrupt 
* vector using Cy_SysInt_Init().
* -# Enable the RTC interrupt using the CMSIS core function NVIC_EnableIRQ().
* 
* After this, provide the configuration parameters in the 
* cy_stc_rtc_dst_t structure. This structure consists of two 
* cy_stc_rtc_dst_format_t structures, one for DST Start time and one for 
* DST Stop time. You also specify whether these times are absolute or relative.
* 
* After the cy_stc_rtc_dst_t structure is filled, call Cy_RTC_EnableDstTime() 
*
* \section group_rtc_lp Low Power Support
* The RTC provides the callback functions to facilitate 
* the low-power mode transition. The callback 
* \ref Cy_RTC_DeepSleepCallback must be called during execution 
* of \ref Cy_SysPm_CpuEnterDeepSleep, \ref Cy_RTC_HibernateCallback must be 
* called during execution of \ref Cy_SysPm_SystemEnterHibernate. 
* To trigger the callback execution, the callback must be registered 
* before calling the mode transition function. 
* Refer to \ref group_syspm driver for more 
* information about low-power mode transitions.
*
* \section group_rtc_section_more_information More Information
*
* For more information on the RTC peripheral, refer to the technical reference
* manual (TRM).
*
* \section group_rtc_MISRA MISRA-C Compliance
* The RTC driver does not have any specific deviations.
*
* \section group_rtc_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="3">2.20</td>
*     <td>Flattened the organization of the driver source code into the single 
*         source directory and the single include directory.
*     </td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>Added register access layer. Use register access macros instead
*         of direct register access using dereferenced pointers.</td>
*     <td>Makes register access device-independent, so that the PDL does 
*         not need to be recompiled for each supported part number.</td>
*   </tr>
*   <tr>
*     <td>Documentation update.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td>2.10</td>
*     <td> 
*          * Corrected Cy_RTC_SetDateAndTimeDirect(), Cy_RTC_SetNextDstTime()
*            function.
*          * Corrected internal macro.
*          * Documentation updates.
*     </td>
*     <td> 
*          * Incorrect behavior of \ref Cy_RTC_SetDateAndTimeDirect() and 
*            \ref Cy_RTC_SetNextDstTime() work in debug mode. 
*          * Debug assert correction in \ref Cy_RTC_ConvertDayOfWeek, 
*            \ref Cy_RTC_IsLeapYear, \ref Cy_RTC_DaysInMonth.
*     </td>
*   </tr>
*   <tr>
*     <td>2.0</td>
*     <td>
*         Enhancement and defect fixes: 
*          * Added input parameter(s) validation to all public functions.
*          * Removed "Cy_RTC_" prefixes from the internal functions names.
*          * Renamed the elements in the cy_stc_rtc_alarm structure.
*          * Changed the type of elements with limited set of values, from 
*            uint32_t to enumeration.
*     </td>
*     <td></td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_rtc_macros Macros
* \defgroup group_rtc_functions Functions
* \{
* \defgroup group_rtc_general_functions General
* \defgroup group_rtc_alarm_functions Alarm
* \defgroup group_rtc_dst_functions DST functions
* \defgroup group_rtc_low_level_functions Low-Level
* \defgroup group_rtc_interrupt_functions Interrupt
* \defgroup group_rtc_low_power_functions Low Power Callbacks
* \}
* \defgroup group_rtc_data_structures Data Structures
* \defgroup group_rtc_enums Enumerated Types
*/

#if !defined (CY_RTC_H)
#define CY_RTC_H

#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include "cy_device_headers.h"
#include "cy_device.h"
#include "cy_syslib.h"
#include "cy_syspm.h"

